Repository: ChronoMonochrome/Flask_survey
Catalog: intro_to_flask/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Submit
ru: Сохранить

source: All fields are required.
ru: Все поля обязательны к заполнению

source: Your data was saved.
ru: Спасибо за участие, данные анкетирования были успешно сохранены.

source: student_form
ru: Форма НСУР

source: predmet_competition
ru: Предметные компетенции

source: metod_competition
ru: Методические компетенции

source: psy_ped_competition
ru: Психолого-педагогические компетенции (оценка индивидуализации обучения, оценка формирования универсальных учебных действий обучающихся)

source: communication_competition
ru: Коммуникативные компетенции (оценка воспитательных аспектов педагогической деятельности, оценка создания мотивирующей образовательной среды)

source: Hello Dash
ru: Привет, Dash

source: Name
ru: ФИО

source: Please enter your name.
ru: Введите ваше ФИО

source: Please enter your email address.
ru: Введите email адрес

source: Subject
ru: Тема сообщения

source: Please enter a subject.
ru: Введите тему сообщения

source: Message
ru: Сообщение

source: Please enter a message.
ru: Введите текст сообщения

source: Send
ru: Отправить

source: Save
ru: Сохранить

source: Login
ru: Логин

source: Please enter your login.
ru: Введите логин

source: Password
ru: Пароль

source: Please enter a password.
ru: Введите пароль

source: Sign In
ru: Войти

source: Invalid login or password
ru: Логин или пароль были введены неверно

source: Role
ru: Тип учетной записи

source: student
ru: Слушатель

source: teacher
ru: Преподаватель

source: employee
ru: Сотрудник

source: Create account
ru: Создать учетную запись

source: That login is already taken
ru: Данный логин уже занят

source: Please choose file to upload
ru: Выберите файл для загрузки

source: school
ru: Школьники

source: parents
ru: Родители

source: teachers
ru: Педагоги

source: municipality_id
ru: Наименование муниципального образования

source: organization_id
ru: Наименование образовательной организации

source: settlement_type_id
ru: Тип поселения

source: level_educational_organization_id
ru: Уровень (ступень) образовательной организации

source: surname
ru: Фамилия

source: name
ru: Имя

source: middle_name
ru: Отчество

source: age_range_id
ru: Возраст

source: teaching_experience_range_id
ru: Общий педагогический стаж работы

source: work_experience_subject_range_id
ru: Стаж работы по предмету

source: total_load_range_id
ru: Общая нагрузка

source: load_on_subject_range_id
ru: Нагрузка по предмету

source: number_of_subjects_taught
ru: Количество преподаваемых предметов

source: education_type_id
ru: Образование

source: category_id
ru: Категория

source: retraining_institution_id
ru: Переподготовка (по предмету)

source: retraining_date_id
ru: Дата переподготовки

source: training_institution_id
ru: Повышение квалификации (по предмету)

source: training_date_id
ru: Дата повышения квалификации

source: About
ru: О сайте

source: contact_form
ru: Форма обратной связи

source: on_contact_msg_sent
ru: Сообщение было успешно отправлено!

source: survey_count
ru: Количество отправленных анкет

source: Home
ru: На главную

source: Contact
ru: Обратная связь

source: Profile
ru: Профиль

source: Dash
ru: Панель

source: Upload
ru: Загрузить файл

source: Sign Out
ru: Выйти

source: Sign Up
ru: Регистрация

source: Greetings
ru: Здравствуйте, вы зашли как

source: profile_str
ru: Профиль

source: greetings_str
ru: Доброго времени суток

source: Sign up
ru: Регистрация

source: add_rows
ru: Добавить строк:

source: add
ru: Добавить

source: data was saved!
ru: Данные были сохранены!

source: form is not valid
ru: Пожалуйста, проверьте заполнение всех полей формы

source: Student form
ru: Профиль

source: File was uploaded successfully!
ru: Файл был успешно загружен!

source: This file extension is not allowed.
ru: Данный формат файла не разрешен к загрузке.

source: No file was selected.
ru: Файл не был выбран.
